Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПоменятьИмяИОтчество(Команда)
    ПоменятьИмяИОтчествоНаСервере();
    Элементы.Список.Обновить();
    Сообщить("Имя и отчество успешно поменяны местами у всех пользователей.");
КонецПроцедуры

&НаСервере
Процедура ПоменятьИмяИОтчествоНаСервере()
    
    Выборка = Справочники.Пользователи.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        Если ЗначениеЗаполнено(Выборка.Имя) И ЗначениеЗаполнено(Выборка.Отчество) Тогда
            
            ОбъектПользователь = Выборка.ПолучитьОбъект();
            
            ВременноеИмя = ОбъектПользователь.Имя;
            ОбъектПользователь.Имя = ОбъектПользователь.Отчество;
            ОбъектПользователь.Отчество = ВременноеИмя;
            
            Попытка
                ОбъектПользователь.Записать();
            Исключение
                Сообщить("Ошибка при записи пользователя " + ОбъектПользователь.Наименование + ": " + ОписаниеОшибки());
            КонецПопытки;
            
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры
